#+title: Ludum Dare 35: Shapeshift

* Idea
- Geometric shape with different properties
  - a gear like form to climb wall
  - a round form to bounce...
  - triangle to make the word turn
  - square for move vertically or horizontally until blocked
- Maybe "eat" the different shape to gain them, or something like that
* Outil
Musique: [[http://boscaceoil.net/][boscaceoil]]
* Roadmap
** DONE better handling of speed when shapeshifting
- State "DONE"       from "TODO"       [2016-04-17 dim. 00:58]
** DONE shapeshift latter
- State "DONE"       from "TODO"       [2016-04-18 lun. 12:50]
To let it seen that the shifter are non blocker
** DONE restart level
- State "DONE"       from "TODO"       [2016-04-17 dim. 01:10]
** DONE music
** DONE sound
- State "DONE"       from "TODO"       [2016-04-17 dim. 12:35]
** ABANDON levels (lot of)
- State "ABANDON"    from "TODO"       [2016-04-18 lun. 12:50]
- make a wall arround it...
* Gens
- [[http://ludumdare.com/compo/ludum-dare-35/?action%3Dpreview&uid%3D11904][eolhing]]
- [[http://ludumdare.com/compo/ludum-dare-35/?action%3Dpreview&uid%3D50996][oparisy]]
- [[http://ludumdare.com/compo/ludum-dare-35/?action%3Dpreview&uid%3D42772][looPing]]
- [[http://ludumdare.com/compo/ludum-dare-35/?action%3Dpreview&uid%3D2982][deepnight]]
- freaknarf
* Classement
| Category   | place | participant |  % | Note |
|------------+-------+-------------+----+------|
| Innovation |   389 |        1123 | 35 | 3.22 |
| Theme      |   416 |        1135 | 37 | 3.44 |
| Fun        |   460 |        1157 | 40 | 3.14 |
| Overall    |   533 |        1194 | 45 | 3.14 |
| Mood       |   619 |        1019 | 61 | 2.69 |
| Graphics   |   754 |        1179 | 64 | 2.47 |
| Humor      |   581 |         795 | 73 | 1.86 |
| Audio      |   523 |         704 | 74 | 2.49 |
#+TBLFM: $4=100*$2/$3;%.0f
